---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Dispose
source: html/7e52642e-a9e7-5320-74ec-3c5f676b807a.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Dispose Method

Releases all resources used by the PointCloudColorSettings

## Syntax (C#)
```csharp
public void Dispose()
```